In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[444,555,444,666],'col3':['abc','def','ghi','xyz']})

In [6]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
len(df['col2'].unique())

3

In [12]:
df['col2'].nunique()

3

In [13]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [17]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2     888
3    1332
Name: col2, dtype: int64

In [16]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [18]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.sort_values('col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   444  ghi
3     4   666  xyz

In [23]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [24]:
df2 = pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
                    'B':['one','one','two','two','one','one'],
                    'C':['x','y','x','y','x','y'],
                    'D':[1,3,2,5,4,1]})

In [25]:
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [26]:
df2.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [27]:
pwd

'C:\\Users\\dhdewangan\\Documents\\Python\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [30]:
dfn1 = pd.read_csv('Example.csv')

In [31]:
dfn1

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
dfn1['A'].loc[2] = 16

In [41]:
dfn1.to_csv('Example.csv',index=False)

In [42]:
dfn2 = pd.read_csv('Example.csv')

In [43]:
dfn2

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2  16   9  10  11
3  12  13  14  15

In [50]:
dfn3 = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [51]:
dfn3['b'].loc[1]=40

In [59]:
dfn3.to_excel('Excel_Sample2.xlsx',sheet_name='Sheet2')

ModuleNotFoundError: No module named 'openpyxl'

In [60]:
dfn5 = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [64]:
dfn5[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 5, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [65]:
from sqlalchemy import create_engine

In [66]:
engine = create_engine('sqlite:///:memory:')

In [68]:
dfn1.to_sql('my_table',engine)

In [69]:
pd.read_sql('my_table',con=engine)

   index   A   B   C   D
0      0   0   1   2   3
1      1   4   5   6   7
2      2  16   9  10  11
3      3  12  13  14  15